
import sentencepiece as spm
spm.SentencePieceTrainer.Train('--input=bochan.txt --model_prefix=sentencepiece --vocab_size=2000 --character_coverage=0.9995')
sp=spm.SentencePieceProcessor()
sp.Load("sentencepiece.model")

#text="1945年 8月 6日、アメリカ軍が 広島市に 原子爆弾を 投下した。その後、1946年 11月 1日に、爆心地に 近い中島町内10.72haが「中島公園」として 都市計画公園に 指定された。1949年の 11月 1日には、「広島平和記念都市建設法」が 制定された。世界に 向けて 人類の 平和を 願い訴えることと、過去の 過ちを 繰り返さないことを 目的に、コンペに より選ばれた 丹下健三が 設計した。そのうち、広島平和記念資料館や 原爆死没者慰霊碑の 設計や、原爆ドーム・原爆死没者慰霊碑・資料館を 結ぶ南北軸、資料館を 中心とする 3棟の 建物による 東西軸は 実現した。当初は 現在の 広島市中央公園や 基町中層アパート群・市営基町高層アパートの 周辺も、平和公園として 構想されていたが 実現しなかった。また、平和大通りについても 構想に 含まれていた。公園南側の 平和大橋・西平和大橋は、アメリカ人彫刻家であるイサム・ノグチの 設計による。公園の 建設にあたっては、敷地内の 多くの バラックを 撤去することとなった。また、敷地内を 走っていた古くからの 繁華街の 道（中島本通 / かつての 西国街道→國道四号）は 残されることになった。1951年 8月 6日に 現在の 区域を 平和記念施設とすることを 決定し、1954年 4月 1日に 完成した。毎年 8月 6日には 平和記念式典が 開催され原爆が 投下された 午前 8時 15分には 黙祷が 捧げられる。式典では、市内中学校、高校の 吹奏楽部による「ひろしま平和の 歌」の 伴奏、広島市の 合唱団等による 合唱が 行われる平和記念公園は 被爆前も 公園だったと 誤った認識が あるが、被爆前は 中島地区と 呼ばれ幕末から 明治・大正にかけて 市内有数の 繁華街として 栄えた 歴史のある街であった（中島町を 参照）。公園の 北側の 原爆ドームが あるあたりは、相生通りを 挟んで広島市中央公園（旧広島市民球場跡地周辺）と 隣接している。平和記念資料館の 公式サイトによれば、平和公園及びその 周辺の 緑地帯には、50を 越える原爆関係の 記念碑・記念建造物がある。建物以外の 多くは原爆犠牲者の 慰霊碑や 平和を 願う記念碑である。その中には、現在公園となっている 地区とその 周辺の 住民、建物疎開に 動員されていた学校・義勇隊、この付近に 所在していた会社・団体・公共機関によるものが 多く 含まれている。被爆まで 現在の 公園地域内に 居住していたため 多くの 犠牲を 出した各町（戦後この地区が 「中島町」として まとめられる以前の 旧町名）の 住民により 建立されたもの。主にノートカトンと チオテルピネオールに 由来する特有の 香りが ある。甘さや 酸味の 他に、ほろ苦さが あるのが 特徴（主成分は ナリンギンなど）。この苦みを 好まない 人もおり、生食の 際に砂糖を まぶして 食べる場合も ある。生で食べるほかに ジュースや 様々な 加工食品に 用いられる。また、絞り汁は カクテルや サワーに 用いられ、グレープフルーツ専用の 搾り器が ある。 皮も マーマレードや ジャムに 使われることも あるが、海外輸入の 物には 品質を 維持するために 農薬（殺菌剤）が 使われていることが 多い。 この農薬を ポストハーベスト農薬と 呼ぶ（日本では 食品添加物扱い）。日本国内で 流通するグレープフルーツの ほとんどは 海外から 輸入されたもので、7割近くを アメリカ産が 占めている。 グレープフルーツの 種からは 抗菌成分が 抽出できる。市販の 食用の グレープフルーツの 種の 発芽率は 高く、土に 埋めておけば比較的簡単に 発芽する。グレープフルーツの 果肉に 含まれる フラノクマリン類は、様々な 医薬品と 相互作用（干渉し、意図しない 効果を 生み出すこと）が ある。  1990年に 報告された。特に カルシウム拮抗剤という 系統の 高血圧治療薬などで グレープフルーツの 影響を 強く受けるものが あることが よく知られている。 このほかに シクロスポリン、ベンゾジアゼピン系、風邪薬でも 主作用、副作用ともに 効果が 効き過ぎることが ある。 阻害様式は、不可逆的に阻害するために 阻害作用は 3〜4日続き、グレープフルーツジュースの 摂取自体を 禁止する必要が ある。フラノクマリン類は 他の 柑橘類にも 含まれるが、含有量は グレープフルーツでは 品種、柑橘類の 種類で 異なる。温州みかんには ほとんど含有しないとされている。果皮には 果汁の さらに 300倍もの フラノクマリンが 含まれる"
with open('Hiroshima_Peace_Park_Wikipedia.txt') as f:
    text = f.read()
    a = len(text)
    test = ["_", "家", "広島", "広島市", "原爆", "原爆ドーム", "原爆爆弾", "平和", "公園",
        "広島市中央公園", "世界", "設計", "爆心地", "資料館", "構想", "バラック", "区域", "繁華街", "地区", "特に",
        "もう", "しかし", "また", 
        "そして", "この", 
        "その", "あの", "私", 
        "おまえ", "日本", 
        "アメリカ", "静か", "多い", "様々", 
        "必要", "相対的", "最終的", "する", "食べる", 
        "落とす","含まる",
        "向ける",
        "残る",
        "呼ぶ",
        "使う",
        "持つ",
        "行う"
        "死ぬ", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
    
    b = sp.EncodeAsPieces(text)
    c = 0
    for i in b:
        if i not in test:
            c += 1
    print(str(c/a *100) + "%")
    print(b)
    f.close()
#text = '親'

