<unk>	0
<s>	0
</s>	0
▁	-2.2106
の	-3.13352
、	-3.45054
。	-3.73139
に	-3.89917
が	-3.97493
を	-3.97493
と	-4.30582
は	-4.37103
・	-4.39753
た	-4.5767
年	-4.94316
月	-4.94316
▁1	-5.02608
い	-5.14264
した	-5.1479
った	-5.22839
▁公園	-5.25385
公園	-5.27099
1	-5.27569
て	-5.39043
地	-5.39228
「	-5.39316
(	-5.39316
▁多く	-5.39316
や	-5.39316
現在	-5.39316
)	-5.39316
6	-5.39316
▁8	-5.39316
」	-5.39316
して	-5.39523
による	-5.39727
された	-5.39859
▁その	-5.42034
中	-5.58052
も	-5.67257
▁平和記念	-5.70415
日に	-5.71584
で	-5.7235
中島	-5.72413
5	-5.72645
原爆	-5.72649
道	-5.72649
定	-5.72649
か	-5.7265
西	-5.7265
▁設計	-5.72652
地区	-5.72772
中島町	-5.72886
資料館	-5.74079
▁周辺	-5.76462
には	-5.81374
▁ま	-5.81982
な	-5.88393
し	-6.01169
広島市	-6.06872
ある	-6.06975
ま	-6.09033
り	-6.16348
され	-6.21488
前	-6.2223
町	-6.22264
内	-6.22549
4	-6.22648
0	-6.22648
近	-6.22648
関	-6.22649
団	-6.22649
奏	-6.22649
って	-6.22649
広島市中央公園	-6.22649
式典	-6.22649
旧	-6.22649
あた	-6.22649
つ	-6.22649
爆	-6.22649
高	-6.22649
▁合唱	-6.22649
▁繁華街	-6.22649
▁願	-6.22649
記念碑	-6.22649
▁されていた	-6.22649
▁実現	-6.22649
▁投下	-6.22649
▁構想	-6.22649
から	-6.22649
け	-6.22649
め	-6.22649
られる	-6.22649
イ	-6.22649
サ	-6.22649
以	-6.22649
側	-6.22649
南	-6.22649
原爆ドーム	-6.22649
原爆死没者	-6.22649
去	-6.22649
域	-6.22649
基町	-6.22649
層アパート	-6.22649
後	-6.22649
心	-6.22649
敷地内	-6.22649
犠牲	-6.22649
街	-6.22649
過	-6.22649
開	-6.22649
▁含まれてい	-6.2265
う	-6.2265
北	-6.2265
この	-6.2265
ち	-6.2265
学校	-6.2265
軸	-6.2265
都市	-6.2265
人	-6.2265
アメリカ	-6.2265
平和大橋	-6.22652
▁住民	-6.22653
195	-6.22657
ばれ	-6.22708
市内	-6.22748
通り	-6.22771
建設	-6.22892
被爆前	-6.23071
である	-6.23234
していた	-6.24625
日には	-6.25502
となっ	-6.25543
平和公園	-6.26271
すること	-6.26594
▁194	-6.28311
広島平和記念	-6.28953
より	-6.29232
▁建物	-6.29242
▁慰霊碑	-6.29374
もの	-6.32116
▁平和	-6.33839
▁ある	-6.40563
こと	-6.47283
える	-6.52859
ている	-6.58647
る	-6.62871
え	-6.7043
ること	-6.71081
平和	-6.90963
▁し	-6.95229
公	-7.04421
建	-7.06567
によ	-7.07162
慰霊碑	-7.0717
建物	-7.07635
周辺	-7.08059
その	-7.08099
194	-7.09417
とする	-7.1319
平和記念資料館	-7.16889
日	-7.19965
よる	-7.20633
▁被爆	-7.21583
設	-7.22024
れ	-7.22069
区	-7.22139
通	-7.2234
市	-7.22358
大	-7.22374
記念	-7.22376
であ	-7.22409
物	-7.2243
さ	-7.22491
ば	-7.22501
9	-7.22627
民	-7.22638
計	-7.22639
住	-7.22639
.	-7.22647
2	-7.22647
7	-7.22647
a	-7.22647
h	-7.22647
会	-7.22647
吹	-7.22647
楽	-7.22647
ひ	-7.22648
び	-7.22648
ろ	-7.22648
ん	-7.22648
体	-7.22648
共	-7.22648
場	-7.22648
挟	-7.22648
決	-7.22648
球	-7.22648
社	-7.22648
跡	-7.22648
部	-7.22648
コ	-7.22649
各	-7.22649
戦	-7.22649
訴	-7.22649
走	-7.22649
越	-7.22649
だ	-7.22649
伴	-7.22649
参	-7.22649
当	-7.22649
/	-7.22649
3	-7.22649
→	-7.22649
く	-7.22649
げ	-7.22649
ぶ	-7.22649
わ	-7.22649
ク	-7.22649
グ	-7.22649
チ	-7.22649
ト	-7.22649
バ	-7.22649
ペ	-7.22649
ム	-7.22649
ン	-7.22649
三	-7.22649
下	-7.22649
世	-7.22649
丹	-7.22649
付	-7.22649
係	-7.22649
健	-7.22649
催	-7.22649
出	-7.22649
初	-7.22649
制	-7.22649
動	-7.22649
午	-7.22649
及	-7.22649
古	-7.22649
号	-7.22649
名	-7.22649
向	-7.22649
呼	-7.22649
員	-7.22649
営	-7.22649
四	-7.22649
国	-7.22649
國	-7.22649
在	-7.22649
外	-7.22649
居	-7.22649
幕	-7.22649
式	-7.22649
弾	-7.22649
所	-7.22649
指	-7.22649
接	-7.22649
撤	-7.22649
数	-7.22649
施	-7.22649
時	-7.22649
有	-7.22649
末	-7.22649
本	-7.22649
栄	-7.22649
校	-7.22649
棟	-7.22649
機	-7.22649
歌	-7.22649
正	-7.22649
残	-7.22649
毎	-7.22649
治	-7.22649
照	-7.22649
生	-7.22649
画	-7.22649
界	-7.22649
疎	-7.22649
的	-7.22649
目	-7.22649
相	-7.22649
祷	-7.22649
等	-7.22649
結	-7.22649
緑	-7.22649
群	-7.22649
者	-7.22649
認	-7.22649
誤	-7.22649
識	-7.22649
軍	-7.22649
造	-7.22649
隣	-7.22649
類	-7.22649
黙	-7.22649
分	-7.2265
子	-7.2265
完	-7.2265
成	-7.2265
捧	-7.2265
東	-7.2265
立	-7.2265
行	-7.2265
選	-7.2265
ッ	-7.2265
ラ	-7.2265
史	-7.2265
帯	-7.2265
明	-7.2265
法	-7.2265
繰	-7.2265
返	-7.2265
隊	-7.2265
▁原	-7.2265
ノ	-7.22651
刻	-7.22651
勇	-7.22651
家	-7.22651
彫	-7.22651
歴	-7.22651
義	-7.22651
れる	-7.22924
平和大	-7.22926
▁建	-7.40434
▁公	-7.44404
▁広島市	-7.77299
願	-8.17577
都	-8.17587
華	-8.17597
繁	-8.17607
犠	-8.17617
牲	-8.17627
没	-8.17637
死	-8.17647
橋	-8.17657
構	-8.17667
敷	-8.17677
投	-8.17687
想	-8.17697
層	-8.17707
実	-8.17717
学	-8.17727
央	-8.17737
基	-8.17747
唱	-8.17757
含	-8.17767
合	-8.17777
典	-8.17787
リ	-8.17797
メ	-8.17807
パ	-8.17817
ド	-8.17827
カ	-8.17837
霊	-8.17847
被	-8.17857
慰	-8.17867
す	-8.17877
館	-8.17887
辺	-8.17897
資	-8.17907
料	-8.17917
多	-8.17927
周	-8.17937
ー	-8.17947
ア	-8.17957
ら	-8.17967
8	-8.17977
碑	-8.17987
そ	-8.17997
現	-8.18007
広	-8.18017
こ	-8.18027
原	-8.18037
よ	-8.18047
記	-8.18057
念	-8.18067
っ	-8.18077
あ	-8.18087
島	-8.18097
園	-8.18107
平	-8.18117
▁中	-8.18127
和	-8.18127
